app/controllers/contacts_controller.rb

  def index
    #@contacts = Contact.all
    @search = Contact.search(params[:search])
    @contacts = @search.all.paginate :page => params[:page], :per_page => 10
---
SELECT * FROM `contacts` WHERE (contacts.first_name LIKE '%pierreç%')
SELECT count(*) AS count_all FROM `contacts` WHERE (contacts.first_name LIKE '%pierreç%')

  def show
    @contact = Contact.find(params[:id])
---
SELECT * FROM `contacts` WHERE (`contacts`.`id` = 64810937)