app/controllers/customers_controller.rb

  def index
    @search = Customer.search(params[:search])
    @customers = @search.all.paginate :page => params[:page], :per_page => 10
---
SELECT * FROM `customers`
SELECT count(*) AS count_all FROM `customers`

  def show
    @customer = Customer.find(params[:id])
---
SELECT * FROM `customers` WHERE (`customers`.`id` = 64810937)