app/controllers/employe_ccq_schedules_controller.rb

SELECT * FROM `employe_ccq_schedules`
---
  def index
    @employe_ccq_schedules = EmployeCcqSchedule.all