app/controllers/employe_ccq_sectors_controller.rb

  def index
    @employe_ccq_sectors = EmployeCcqSector.all
---
SELECT * FROM `employe_ccq_sectors`