app/controllers/employes_controller.rb

  def index
    @search = Employe.search(params[:search])
    @employes = @search.all.paginate :page => params[:page], :per_page => 10
---
SELECT * FROM `employes` WHERE (employes.first_name LIKE '%emilie%')
SELECT count(*) AS count_all FROM `employes` WHERE (employes.first_name LIKE '%emilie%')

  def show
    @employe = Employe.find(params[:id])
    @employe_pay_infos = EmployePayInfo.find(params[:id])
    @employe_attachments = EmployeAttachment.paginate :page => params[:page], :per_page => 5, :conditions => ['employes_id = ?', @employe.id]
---
SELECT * FROM `employes` WHERE (`employes`.`id` = 1)
SELECT * FROM `employe_attachments` WHERE (employes_id = 1) LIMIT 0, 5