app/controllers/employe_ccq_qualifications_controller.rb

  def index
    @employe_ccq_qualifications = EmployeCcqQualification.all
---
SELECT * FROM `employe_ccq_qualifications`