app/controllers/employe_ccq_trades_controller.rb

  def index
    @search = EmployeCcqTrade.search(params[:search])
    @employe_ccq_trades = @search.all.paginate :page => params[:page], :per_page => 10
---
SELECT * FROM `employe_ccq_trades` WHERE (employe_ccq_trades.trade_name_fr LIKE '%El%')
SELECT count(*) AS count_all FROM `employe_ccq_trades` WHERE (employe_ccq_trades.trade_name_fr LIKE '%El%')

  def show
    @employe_ccq_trade = EmployeCcqTrade.find(params[:id])
---
SELECT * FROM `employe_ccq_trades` WHERE (`employe_ccq_trades`.`id` = 4372113)

  def edit
    @employe_ccq_trade = EmployeCcqTrade.find(params[:id])
---
SELECT * FROM `employe_ccq_trades` WHERE (`employe_ccq_trades`.`id` = 587188514)

  def update
    @employe_ccq_trade = EmployeCcqTrade.find(params[:id])

    respond_to do |format|
      if @employe_ccq_trade.update_attributes(params[:employe_ccq_trade])
---
SELECT * FROM `employe_ccq_trades` WHERE (`employe_ccq_trades`.`id` = 587188514)
UPDATE `employe_ccq_trades` SET `trade_name_en` = 'Boiler maker', `updated_at` = '2010-02-13 13:19:04' WHERE `id` = 587188514