app/controllers/projects_controller.rb

  def index
    @search = Project.search(params[:search])
    @projects = @search.all.paginate :page => params[:page], :per_page => 10
---
SELECT * FROM `projects` WHERE (projects.name LIKE '%pop%')
SELECT count(*) AS count_all FROM `projects` WHERE (projects.name LIKE '%pop%')