app/controllers/suppliers_controller.rb

SELECT * FROM `suppliers` WHERE (suppliers.supplier_name LIKE '%lumen%')
SELECT count(*) AS count_all FROM `suppliers` WHERE (suppliers.supplier_name LIKE '%lumen%')
---
  def index
    #@suppliers = Supplier.all
    @search = Supplier.search(params[:search])
    @suppliers = @search.all.paginate :page => params[:page], :per_page => 10

SELECT * FROM `suppliers` WHERE (`suppliers`.`id` = 450215437)
---
  def show
    @supplier = Supplier.find(params[:id])